app/Controllers/CongeController.php

INSERT INTO `Conges` (`employe_id`, `type_conge_id`, `date_debut`, `date_fin`, `nb_jours`, `motif`, `statut`, `commentaire_rh`, `traite_par`) VALUES (1, 1, '2026-05-20', '2026-05-21', 1, '6 nombres de jours prix', 'en_attente', NULL, NULL)
---
            ]);
        }

        if (! $model->db->table('Conges')->insert($data)) {