app/Controllers/EmployeController.php

        public function dashboard()
        {
            $user = session()->get('user');
            $CongeEnAttente = new CongeModel();
            $typesConge = new TypeCongeModel();
            $SoldeModel = new SoldeModel();
            $nbJoursPris = [];
            $nbJoursrestants = [];
            foreach ($typesConge->findAll() as $type) {
                $nbJoursrestants[$type['id']] = $SoldeModel->hasSoldeDisponible($user['id'], $type['id'] , (int)date('Y'));
                $nbJoursPris[$type['id']] = $SoldeModel->getNombreJoursPrix($user['id'], $type['id'] , (int)date('Y'));
            }

            $typesConge = $typesConge->findAll();
            $employeId = session()->get('user')['id'] ?? null;
            $congeEnAttente = $CongeEnAttente->getCongesEnAttenteByEmploye($employeId);
            $congeApprouve = $CongeEnAttente->getCongesApprouvesByEmploye($employeId);
            $congerefuse = $CongeEnAttente->getCongesRefusesByEmploye($employeId);
            $congeLimited = $CongeEnAttente->getCongesByEmployeLimited($employeId, 3);

            return view('Modal', [
                'page' => 'employe/Dashboard',
                'active' => 'dashboard',
                'user' => session()->get('user'),
                'congesEnAttente' => $congeEnAttente,
                'congesApprouve' => $congeApprouve,
                'congesRefuse' => $congerefuse  ,
                'congesLimited' => $congeLimited,
                'typesConge' => $typesConge,
                'nbJoursPris' => $nbJoursPris,
                'nbJoursrestants' => $nbJoursrestants
            ]);
---
SELECT *
FROM `Types_conges`