app/Models/CongeModel.php

	public function getCongesByEmploye($employeId)
	{
		return $this->where('employe_id', $employeId)->join('Employes', 'Conges.employe_id = Employes.id')->join('Types_conges', 'Conges.type_conge_id = Types_conges.id')->findAll();
---
SELECT *
FROM `Conges`
JOIN `Employes` ON `Conges`.`employe_id` = `Employes`.`id`
JOIN `Types_conges` ON `Conges`.`type_conge_id` = `Types_conges`.`id`
WHERE `employe_id` = 1

	public function getCongesEnAttente()
	{
		return $this->db->table('Conges c')
			->select('c.*, e.nom AS employe_nom, d.nom AS employe_departement, tc.libelle AS type_conge_nom, solde.jours_attribues AS solde_attribue, solde.jours_pris AS solde_pris, (solde.jours_attribues - solde.jours_pris) AS solde_restant', false)
			->join('Employes e', 'e.id = c.employe_id')
			->join('Departements d', 'd.id = e.departement_id', 'left')
			->join('Types_conges tc', 'tc.id = c.type_conge_id', 'left')
			->join('Soldes solde', 'solde.employe_id = c.employe_id AND solde.type_conge_id = c.type_conge_id AND solde.annee = CAST(strftime(\'%Y\', c.date_debut) AS INTEGER)', 'left')
			->where('c.statut', 'en_attente')
			->orderBy('c.id', 'DESC')
			->get()
			->getResultArray();
---
SELECT c.*, e.nom AS employe_nom, d.nom AS employe_departement, tc.libelle AS type_conge_nom, solde.jours_attribues AS solde_attribue, solde.jours_pris AS solde_pris, (solde.jours_attribues - solde.jours_pris) AS solde_restant
FROM `Conges` `c`
JOIN `Employes` `e` ON `e`.`id` = `c`.`employe_id`
LEFT JOIN `Departements` `d` ON `d`.`id` = `e`.`departement_id`
LEFT JOIN `Types_conges` `tc` ON `tc`.`id` = `c`.`type_conge_id`
LEFT JOIN `Soldes` `solde` ON `solde`.`employe_id` = `c`.`employe_id` AND `solde`.`type_conge_id` = `c`.`type_conge_id` AND `solde`.`annee` = CAST(strftime('%Y', c.date_debut) AS INTEGER)
WHERE `c`.`statut` = 'en_attente'
ORDER BY `c`.`id` DESC

		public function getCongesApprouver()
	{
		return $this->db->table('Conges c')
			->select('c.*, e.nom AS employe_nom, d.nom AS employe_departement, tc.libelle AS type_conge_nom, rh.nom AS rh_nom, solde.jours_attribues AS solde_attribue, solde.jours_pris AS solde_pris, (solde.jours_attribues - solde.jours_pris) AS solde_restant', false)
			->join('Employes e', 'e.id = c.employe_id')
			->join('Employes rh', 'rh.id = c.traite_par', 'left')
			->join('Departements d', 'd.id = e.departement_id', 'left')
			->join('Types_conges tc', 'tc.id = c.type_conge_id', 'left')
			->join('Soldes solde', 'solde.employe_id = c.employe_id AND solde.type_conge_id = c.type_conge_id AND solde.annee = CAST(strftime(\'%Y\', c.date_debut) AS INTEGER)', 'left')
			->where('c.statut', 'approuve')
			->orderBy('c.id', 'DESC')
			->get()
			->getResultArray();
---
SELECT c.*, e.nom AS employe_nom, d.nom AS employe_departement, tc.libelle AS type_conge_nom, rh.nom AS rh_nom, solde.jours_attribues AS solde_attribue, solde.jours_pris AS solde_pris, (solde.jours_attribues - solde.jours_pris) AS solde_restant
FROM `Conges` `c`
JOIN `Employes` `e` ON `e`.`id` = `c`.`employe_id`
LEFT JOIN `Employes` `rh` ON `rh`.`id` = `c`.`traite_par`
LEFT JOIN `Departements` `d` ON `d`.`id` = `e`.`departement_id`
LEFT JOIN `Types_conges` `tc` ON `tc`.`id` = `c`.`type_conge_id`
LEFT JOIN `Soldes` `solde` ON `solde`.`employe_id` = `c`.`employe_id` AND `solde`.`type_conge_id` = `c`.`type_conge_id` AND `solde`.`annee` = CAST(strftime('%Y', c.date_debut) AS INTEGER)
WHERE `c`.`statut` = 'approuve'
ORDER BY `c`.`id` DESC

	public function approuverConge(int $congeId, int $rhId, int $annee, ?string $commentaire = null): bool
	{
		$this->db->transStart();

		$conge = $this->find($congeId);
---
SELECT *
FROM `Conges`
WHERE `Conges`.`id` = 3

	public function refuserConge(int $congeId, int $rhId, ?string $commentaire = null): bool
	{
		$conge = $this->find($congeId);
---
SELECT *
FROM `Conges`
WHERE `Conges`.`id` = 3

	public function annulerConge(int $congeId, int $annee): bool
	{
		$this->db->transStart();

		$conge = $this->find($congeId);
		if (! $conge || $conge['statut'] === 'annule' || $conge['statut'] === 'refuse') {
			$this->db->transRollback();
			return false;
		}

		$okConge = $this->update($congeId, ['statut' => 'annule']);
---
UPDATE `Conges` SET `statut` = 'rejete', `commentaire_rh` = '', `traite_par` = 3,  = '2026-05-20 08:38:18'
WHERE `Conges`.`id` IN (3)