app/Models/EmployeModel.php

SELECT *
FROM `Employes`
WHERE `email` = 'admin@entreprise.com'
 LIMIT 1
---
    public function getEmployeByEmail(string $email): ?array
    {
        return $this->where('email', $email)->first();