app/Models/SoldeModel.php

    public function getSolde(int $employeId, int $typeCongeId, int $annee): ?array
    {
        return $this->where([
            'employe_id' => $employeId,
            'type_conge_id' => $typeCongeId,
            'annee' => $annee,
        ])->first();
---
SELECT *
FROM `Soldes`
WHERE `employe_id` = 1
AND `type_conge_id` = 1
AND `annee` = 2026
 LIMIT 1

    public function updateJoursPris(int $soldeId, int $deltaJours): bool
    {
        $solde = $this->find($soldeId);
        if (! $solde) {
            return false;
        }

        $nouveau = (int) $solde['jours_pris'] + $deltaJours;
        if ($nouveau < 0) {
            return false;
        }

        return $this->update($soldeId, ['jours_pris' => $nouveau]);
---
SELECT *
FROM `Soldes`
WHERE `Soldes`.`id` = 1
UPDATE `Soldes` SET `jours_pris` = 6
WHERE `Soldes`.`id` IN (1)